---
type: ViewNode
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ViewNode

`Autodesk.Revit.DB.ViewNode` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCameraInfo | 2014 | `public CameraInfo GetCameraInfo ()` |
| Property | LevelOfDetail | 2014 | `public int LevelOfDetail { get ; set ; }` |
| Property | ViewId | 2014 | `public ElementId ViewId { get ; }` |